martingener/microcontrollerfinal/Control_PIC18F4321.c
#include <stdio.h>
#include <stdlib.h>
#include <xc.h>
#include <math.h>
#include <p18f4620.h>
#include <usart.h>
#pragma config OSC      =   INTIO67
#pragma config BOREN    =   OFF
#pragma config WDT      =   OFF
#pragma config LVP      =   OFF
#pragma config CCP2MX   =   PORTBE
#define _XTAL_FREQ          8000000
#define DS3231_ID       0x68
#define DS3231_Add_00   0x00
#define DS3231_Add_07   0x07
#define DS3231_Add_0E   0x0E
#define DS3231_Add_0F   0x0F
#define DS3231_Add_11   0x11
#define ACCESS_CFG      0xAC
#define START_CONV      0xEE
#define READ_TEMP       0xAA
#define CONT_CONV       0x02
#define ACK             1
#define NAK             0
#define ON              1
#define OFF             0
#define Key_Up          0x00ffe21d
#define Key_Dn          0x00ffa25d
#define Key_Done        0x00ffc23d
#define Key_Abort       0x00ff22dd
#define Key_Next        0x00ff02fd
#define Key_EQ          0x00ff906f
#define Key_Plus        0x00ffa857
#define Key_Minus       0x00ffe01f

//  MAIN SCREEN & TIME SETUP SCREEN
#define start_x             1
#define start_y             2
#define temp_x              28
#define temp_y              13
#define circ_x              40
#define circ_y              26
#define data_tempc_x        15
#define data_tempc_y        26
#define tempc_x             45
#define tempc_y             26
#define cirf_x              95
#define cirf_y              26
#define data_tempf_x        70
#define data_tempf_y        26
#define tempf_x             100
#define tempf_y             26
#define time_x              50
#define time_y              46
#define data_time_x         15
#define data_time_y         56
#define date_x              50
#define date_y              76
#define data_date_x         15
#define data_date_y         86
#define alarm_x             10
#define alarm_y             107
#define data_alarm_x        14
#define data_alarm_y        118
#define LED_Int_x           50
#define LED_Int_y           107
#define data_LED_Int_x      50
#define data_LED_Int_y      118     
#define HTR_x               85
#define HTR_y               107
#define data_HTR_x          95
#define data_HTR_y          118
#define HTR_S_x             15
#define HTR_S_y             130    
#define data_HTR_S_x        46
#define data_HTR_S_y     144
#define cirf_HTR_S_x     73
#define cirf_HTR_S_y     144      
#define tempf_HTR_S_x     78
#define tempf_HTR_S_y     144    
  
//  Setup Heater SCREEN    
#define S_HTR_S_x           15
#define S_HTR_S_y           80    
#define S_data_HTR_S_x     46
#define S_data_HTR_S_y     94
#define S_cirf_HTR_S_x     73
#define S_cirf_HTR_S_y     94      
#define S_tempf_HTR_S_x     78
#define S_tempf_HTR_S_y     94 
    
#define TS_1            1               // Size of Normal Text
#define TS_2            2               // Size of Number Text
void interrupt high_priority chkisr() ;
void INT0_isr(void);
void INT1_isr(void);
void INT2_isr(void);
void TIMER1_isr(void);
void Do_Setup_Time();
void Do_Setup_Alarm_Time(void);
void Do_Setup_Heater_Temp(void);
void Initialize_Main_Screen(void);
void Do_Update_Main_Screen(void);
void Initialize_Setup_Time_Screen(void);
void Update_Setup_Time_Screen(void);
void Initialize_Setup_Alarm_Screen(void);
void Update_Setup_Alarm_Screen(void);
void Update_Setup_Screen_Cursor(char);
void Initialize_Setup_Heater_Screen(void);
void Update_Setup_Heater_Screen(void);
void DS3231_Init(char);
void DS3231_Read_Time(char);
void DS3231_Write_Time(char);
int  DS3231_Read_Temp(char);
void DS3231_Read_Alarm_1_Time(char);
void DS3231_Write_Alarm_1_Time(char);
void DS3231_Turn_Off_Alarm(char device);
void DS3231_Turn_On_Alarm(char device);
void Do_LED_Up(void);
void Do_LED_Down(void);
void delay_ms(int ms);
void gen_2khz_sound();
void turn_off_sound();
int  bcd_2_dec(char);
int  dec_2_bcd(char);
unsigned int Get_Full_ADC(void);
void Select_ADC(char);
void  SPI_out(unsigned char);

unsigned int get_full_ADC(void);
float Read_Volt_In(void);
void Do_LED_Out(char volt);
void LED_Alarm(void);

#define D1RED PORTDbits.RD0
#define D1GREEN PORTDbits.RD1
#define D1BLUE PORTDbits.RD2

#define TFT_DC          PORTEbits.RE0
#define TFT_CS          PORTEbits.RE1
#define TFT_RST         PORTEbits.RE2
#define PULSE           PORTAbits.RA5
                                
#define SCL_PIN         PORTBbits.RB5
#define SCL_DIR         TRISBbits.RB5
#define SDA_PIN         PORTBbits.RB4
#define SDA_DIR         TRISBbits.RB4
#define alarm_sw        PORTAbits.RA4                                           // put your port assigment here from the schematics
#define heater_sw       PORTAbits.RA5                                           // put your port assigment here from the schematics
#define Chip_Select     PORTCbits.RC1                                           // put your port assigment here from the schematics
#define heater_on_led   PORTCbits.RC0                                           // put your port assigment here from the schematics
#define BEEP            PORTBbits.RB3
char buffer[31] = " ECE3301L Spring 2019\0";
char *nbr;
char *txt;
char tempC[]            = "25";
char tempF[]            = "77";
char time[]             = "00:00:00";
char date[]             = "01/01/00";
char alarm_text[]       = "OFF";
char LED_Int_text[]     = "00";
char heater_text[]      = "OFF";   
char heater_S_text[] = "60";
char setup_time[]       = "00:00:00";
char setup_date[]       = "01/01/00";
char setup_alarm_time[] = "00:00:00"; 
    
char setup_heater_S_text[]  = "60";
    
char nec_state, nec_ok;
unsigned long long nec_code;
unsigned char cnt, second, minute, hour, dow, day, month, year, old_second;
unsigned char alarm_second, alarm_minute, alarm_hour, alarm_date;
unsigned char setup_alarm_second, setup_alarm_minute, setup_alarm_hour;
unsigned char setup_second, setup_minute, setup_hour, setup_day, setup_month, setup_year;
unsigned char alarm_mode, alarm_match_flag, alarm_clear_flag, alarm_on_flag;
unsigned char heater_mode;
char contr;
int DS3231_tempC, DS3231_tempF;
unsigned char set_heater_temp, setup_heater_temp;
float Volt;
unsigned char LED_Intensity;
int bit_count;
int count = 0;
int alarm_count = 0;
void interrupt high_priority chkisr()    //hardware flag
{
    if (INTCONbits.INT0IF == 1) INT0_isr();
    if (INTCON3bits.INT1IF == 1) INT1_isr();
    if (INTCON3bits.INT2IF == 1) INT2_isr();
    if (PIR1bits.TMR1IF == 1) TIMER1_isr();
}
void INT0_isr(void)
{
    INTCONbits.INT0IF = 0;
    alarm_on_flag = 0;
    turn_off_sound();
    PORTD = 0;
    DS3231_Turn_Off_Alarm(DS3231_ID);
    INTCON3bits.INT1IE = 0;
    
