martingener/microcontrollerfinal/Control_PIC18F4321.c
}
void INT1_isr(void)
{
    INTCON3bits.INT1IF = 0;
    if (alarm_mode == 1) alarm_on_flag = 1;
    else alarm_on_flag = 0;
}
void INT2_isr(void)
{
unsigned int timer;    
 INTCON3bits.INT2IF = 0;                                                        // Clear external interrupt 
 
 if (nec_state != 0)   
 {      
  timer = (TMR1H << 8) | TMR1L;                                                 // Store Timer1 value      
  TMR1H = 0;                                                                    // Reset Timer1     
  TMR1L = 0;      
 }   
 
 switch(nec_state)    
 {      
  case 0 : 
    TMR1H = 0;
    TMR1L = 0;
    T1CON = 0x90;                                                               // Timer mode with count
    T1CONbits.TMR1ON = 1;            
    bit_count = 0;                                                              // Force the bit count to be 0
    nec_code = 0;
    INTCON2bits.INTEDG2 = 1;                                                    // 1 is rising edge 
    nec_state = 1;
    return;
        
  case 1 :
    if ((timer >= 8500) && (timer <= 9500))
    {
     INTCON2bits.INTEDG2 = 0;                                                   // 0 is falling edge  (high to low)
     nec_state = 2;
    }
            
    else  nec_state = 0;
    return;
            
  case 2 :
    if (( timer >= 4000) && (timer <= 5000))
    {
     INTCON2bits.INTEDG2 = 1;                                                   // 1 is rising edge (low to high)
     nec_state = 3;
    }
            
    else nec_state = 0;
    return;
        
  case 3: 
    if ((timer >= 400) && (timer <= 700))
    {
     INTCON2bits.INTEDG2 = 0;                                                   // 1 is rising edge (high to low))
     nec_state = 4;
    }
     
    else nec_state = 0;
    return;
            
  case 4:
    if((timer >= 400) && (timer <= 1800))
    {
     nec_code = nec_code << 1;
     if( timer > 1000)
     {
      nec_code = nec_code + 1;
     }
     bit_count = bit_count + 1;
                
     if(bit_count > 31)
     {
      nec_ok = 1;
      INTCON3bits.INT2IE = 0;              
     }
            
     else
     {
      INTCON2bits.INTEDG2 = 1;                                                  // high to low rising edge
      nec_state = 3;
     }
    }
    
    else nec_state = 0;
    return;          
   } 
}
void TIMER1_isr(void)
{
    nec_state = 0;                                                                 // Resets the decoding process   
    INTCON2bits.INTEDG2 = 0;                                                       // INT2 falling edge  
    T1CONbits.TMR1ON=0;                                                            // Disables the T1 Timer  
    PIR1bits.TMR1IF=0;                                                             // Clears the interrupt flag 
}
#include "ST7735_TFT.inc"
#include "softi2c.inc"

void putch (char c)
{   
    while (!TRMT);       
    TXREG = c;
}
void init_UART()
{
    OpenUSART (USART_TX_INT_OFF & USART_RX_INT_OFF & USART_ASYNCH_MODE & USART_EIGHT_BIT & USART_CONT_RX & USART_BRGH_HIGH, 25);
    OSCCON = 0x70;
}
void main()
{
    init_UART();
    OSCCON = 0x70;
    ADCON1 = 0x0b;                       //
    nRBPU = 0;                           // Enable PORTB internal pull up resistor
    TRISA = 0x3f;
    TRISB = 0x07;
    TRISC = 0x00;
    TRISD = 0x00;
    TRISE = 0x00;  
    CCP2CON = 0x0;
    
    
    INTCONbits.INT0IF  = 0;             // INT0 IF is in INTCON
    INTCON3bits.INT1IF = 0;             // INT1 IF is in INTCON3
    INTCON3bits.INT2IF = 0;             // Clear external interrupt
    
    INTCONbits.INT0IE  = 1;             // INT0 IE is in INTCON
    INTCON3bits.INT1IE = 1;             // INT1 IE is in INTCON3
    INTCON3bits.INT2IE = 1;             // INT2 IE is in INTCON3
   
    
    INTCON2bits.INTEDG0 = 0;            // Edge programming for INT0, INT1 and 
    INTCON2bits.INTEDG1 = 0;            // INT2 are in INTCON2
    INTCON2bits.INTEDG2 = 0;            // Edge programming for INT2 falling edge   
    
    INTCONbits.PEIE = 1;                // Enable Peripheral interrupt
    INTCONbits.GIE = 1;
// enable global interrupt
     
    I2C_Init(100000);                   // Initialize I2C Master with 100KHz clock 
    txt = buffer;    
    LCD_Reset();                        // Screen reset
    TFT_GreenTab_Initialize();     
    DS3231_Init(DS3231_ID);
    set_heater_temp = 60;
    
    Initialize_Main_Screen();
    
    TMR1L = 0;
    TMR1H = 0;
    T1CON = 0x83;
    PIR1bits.TMR1IF=0;                   // Clear interrupt flag
    PIE1bits.TMR1IE = 1;                 // Enable Timer 1 interrupt    
    nec_ok = 0;  
    nec_code = 0x0;
    alarm_mode = 0;
    heater_mode = 0;    
    alarm_match_flag = 0;
    LED_Intensity = 0;
    SPI_out(LED_Intensity + 100);
    PORTD = 0;
    
    BEEP = 0;
    
    while(TRUE)
    {     
        DS3231_Read_Time(DS3231_ID);
        if (second != old_second)
        {
            alarm_mode = alarm_sw;
            if (alarm_mode == 1)
                DS3231_Turn_On_Alarm(DS3231_ID);
            if (alarm_mode == 0)
                DS3231_Turn_Off_Alarm(DS3231_ID);
            heater_mode = heater_sw;

            DS3231_tempC = DS3231_Read_Temp(DS3231_ID);                
            Do_Update_Main_Screen();
            
            if((DS3231_tempF < set_heater_temp) && (heater_mode == 1))
                heater_on_led = ON;
            else
                heater_on_led = OFF;
            
          
            printf ("Time: %02x:%02x:%02x  Date: %02x:%02x:%02x  ",hour,minute,second,month,day,year);
            printf ("Temp: %2d C %2d F\r", DS3231_tempC,DS3231_tempF);
            old_second = second;                  
            /*if (alarm_on_flag == 1 && alarm_mode == 1)
            {
                gen_2khz_sound();
                LED_Alarm();
            }*/
            if (alarm_on_flag == 1 && alarm_mode == 1)
            {
                gen_2khz_sound();
                LED_Alarm();
            }
         
