martingener/microcontrollerfinal/Control_PIC18F4321.c
        }
        
        Read_Volt_In();
        Do_LED_Out(Volt);
        printf("\rVolt = %f", Volt);
            
        if (nec_ok == 1)
        {       
            INTCON3bits.INT2IE = 1;                 // Enable external interrupt
            INTCON2bits.INTEDG2 = 0;                // Edge programming for INT0 falling edge
            nec_ok = 0;
            if (nec_code == Key_EQ) Do_Setup_Time();
            if (nec_code == Key_Plus) Do_Setup_Alarm_Time();
            if (nec_code == Key_Minus) Do_Setup_Heater_Temp();
            if (nec_code == Key_Up) Do_LED_Up();
            if (nec_code == Key_Dn) Do_LED_Down();
        } 
        
    }
}
void Initialize_Main_Screen(void) 
{ 
    fillScreen(ST7735_BLACK);                                    // Fills background of screen with color passed to it
 
    strcpy(txt, " ECE3301L Spring 2019\0");                                 // Text displayed 
    drawtext(start_x , start_y, txt, ST7735_WHITE  , ST7735_BLACK, TS_1);   // X and Y coordinates of where the text is to be displayed
    strcpy(txt, "Temperature:");
    drawtext(temp_x  , temp_y , txt, ST7735_MAGENTA, ST7735_BLACK, TS_1);                                                                                               // including text color and the background of it
    drawCircle(circ_x, circ_y , 2  , ST7735_YELLOW);
    strcpy(txt, "C/");
    drawtext(tempc_x , tempc_y, txt, ST7735_YELLOW , ST7735_BLACK, TS_2); 
    drawCircle(cirf_x, cirf_y , 2  , ST7735_YELLOW);
    strcpy(txt, "F");         
    drawtext(tempf_x , tempf_y, txt, ST7735_YELLOW , ST7735_BLACK, TS_2);
    strcpy(txt, "Time");
    drawtext(time_x  , time_y , txt, ST7735_BLUE   , ST7735_BLACK, TS_1);
    strcpy(txt, "Date");
    drawtext(date_x  , date_y , txt, ST7735_RED    , ST7735_BLACK, TS_1);
    strcpy(txt, "ALARM");
    drawtext(alarm_x , alarm_y, txt, ST7735_WHITE   , ST7735_BLACK, TS_1);
    strcpy(txt, "LED");
    drawtext(LED_Int_x, LED_Int_y, txt, ST7735_WHITE   , ST7735_BLACK, TS_1);
    strcpy(txt, "Heater");
    drawtext(HTR_x   , HTR_y  , txt, ST7735_WHITE   , ST7735_BLACK, TS_1);
    strcpy(txt, "Heater Set Temp");
    drawtext(HTR_S_x , HTR_S_y, txt, ST7735_YELLOW  , ST7735_BLACK, TS_1);
    drawCircle(cirf_HTR_S_x, cirf_HTR_S_y , 2  , ST7735_BLUE);
    strcpy(txt, "F");         
    drawtext(tempf_HTR_S_x , tempf_HTR_S_y, txt, ST7735_BLUE , ST7735_BLACK, TS_2);
}
void Do_Update_Main_Screen(void)
{
    DS3231_tempC = DS3231_Read_Temp(DS3231_ID);
    DS3231_tempF = DS3231_tempC*9/5 + 32;
    tempC[0]  = DS3231_tempC/10  + '0';
    tempC[1]  = DS3231_tempC%10  + '0';
    tempF[0]  = DS3231_tempF/10  + '0';
    tempF[1]  = DS3231_tempF%10  + '0';
    time[0]  = (hour>>4)  + '0';
    time[1]  = (hour & 0x0f)+ '0';  
    time[3]  = (minute>>4)  + '0';
    time[4]  = (minute & 0x0f)+ '0';
    time[6]  = (second>>4)  + '0';
    time[7]  = (second & 0x0f)+ '0'; 
    date[0]  = (month>>4)  + '0';
    date[1]  = (month & 0x0f)+ '0';  
    date[3]  = (day>>4)  + '0';
    date[4]  = (day & 0x0f)+ '0';
    date[6]  = (year>>4)  + '0';
    date[7]  = (year & 0x0f)+ '0';
    
    if (alarm_mode == 1) 
    {   
     
        strcpy(alarm_text, "ON ");
        
    }
    else 
    {
        strcpy(alarm_text, "OFF");
    }
    
    LED_Int_text[0]  = LED_Intensity/10  + '0';
    LED_Int_text[1]  = LED_Intensity%10  + '0';
    
    if (heater_mode == 1)
    {
        strcpy(heater_text, "ON ");
        heater_S_text[0]  = set_heater_temp/10  + '0';
        heater_S_text[1]  = set_heater_temp%10  + '0';
    
    }
    else 
    {
        strcpy(heater_text, "OFF");
        heater_S_text[0]  = '-';
        heater_S_text[1]  = '-';
    }
    
    drawtext(data_tempc_x, data_tempc_y , tempC , ST7735_YELLOW , ST7735_BLACK , TS_2);       
    drawtext(data_tempf_x, data_tempf_y , tempF , ST7735_YELLOW , ST7735_BLACK , TS_2);
    drawtext(data_time_x , data_time_y  , time  , ST7735_CYAN   , ST7735_BLACK , TS_2);
    drawtext(data_date_x , data_date_y  , date  , ST7735_GREEN  , ST7735_BLACK , TS_2);
    drawtext(data_alarm_x, data_alarm_y , alarm_text, ST7735_MAGENTA, ST7735_BLACK, TS_1);
    drawtext(data_LED_Int_x, data_LED_Int_y , LED_Int_text, ST7735_MAGENTA, ST7735_BLACK, TS_1);    
    drawtext(data_HTR_x  , data_HTR_y   , heater_text, ST7735_MAGENTA, ST7735_BLACK, TS_1);
    drawtext(data_HTR_S_x, data_HTR_S_y , heater_S_text, ST7735_BLUE, ST7735_BLACK, TS_2);
}
void Initialize_Setup_Time_Screen(void) 
{ 
    fillScreen(ST7735_BLACK);                                    // Fills background of screen with color passed to it
 
    strcpy(txt, " ECE3301L Spring 2019\0");                      // Text displayed 
    drawtext(start_x , start_y, txt, ST7735_WHITE  , ST7735_BLACK, TS_1);
// X and Y coordinates of where the text is to be displayed
    strcpy(txt, "Time Setup\0");                                // Text displayed 
    drawtext(start_x+3 , start_y+15, txt, ST7735_MAGENTA, ST7735_BLACK, TS_2); 
       
    strcpy(txt, "Time");
    drawtext(time_x  , time_y , txt, ST7735_BLUE   , ST7735_BLACK, TS_1);
    
    fillRect(data_time_x-1, data_time_y+16, 25,2,ST7735_CYAN);
    strcpy(txt, "Date");
    drawtext(date_x  , date_y , txt, ST7735_RED    , ST7735_BLACK, TS_1);
}
void Update_Setup_Time_Screen(void)
{
    setup_time[0]  = (setup_hour/10)  + '0';
    setup_time[1]  = (setup_hour%10)  + '0';  
    setup_time[3]  = (setup_minute/10)  + '0';
    setup_time[4]  = (setup_minute %10)+ '0';
    setup_time[6]  = (setup_second/10)  + '0';
    setup_time[7]  = (setup_second %10)+ '0'; 
    setup_date[0]  = (setup_month/10)  + '0';
    setup_date[1]  = (setup_month %10)+ '0';  
    setup_date[3]  = (setup_day/10)  + '0';
    setup_date[4]  = (setup_day %10)+ '0';
    setup_date[6]  = (setup_year/10)  + '0';
    setup_date[7]  = (setup_year %10)+ '0';
    drawtext(data_time_x, data_time_y, setup_time, ST7735_CYAN, ST7735_BLACK, TS_2);
    drawtext(data_date_x, data_date_y, setup_date, ST7735_GREEN, ST7735_BLACK, TS_2);
}
void Update_Setup_Screen_Cursor(char cursor_position)
{
    char xinc = 36;
    char yinc = 30;   
    switch (cursor_position)
    {
        case 0:
            fillRect(data_time_x-1+2*xinc, data_time_y+16+yinc, 25,2,ST7735_BLACK);
            fillRect(data_time_x-1+2*xinc, data_time_y+16, 25,2,ST7735_BLACK);
            fillRect(data_time_x-1, data_time_y+16, 25,2,ST7735_CYAN);
            break;
            
        case 1:
            fillRect(data_time_x-1, data_time_y+16, 25,2,ST7735_BLACK);
            fillRect(data_time_x-1+xinc, data_time_y+16, 25,2,ST7735_CYAN);
            break; 
            
