martingener/microcontrollerfinal/Control_PIC18F4321.c
        case 2:
            fillRect(data_time_x-1+xinc, data_time_y+16, 25,2,ST7735_BLACK);
            fillRect(data_time_x-1+2*xinc, data_time_y+16, 25,2,ST7735_CYAN);
            break;  
            
        case 3:
            fillRect(data_time_x-1+2*xinc, data_time_y+16, 25,2,ST7735_BLACK);
            fillRect(data_time_x-1, data_time_y+16+yinc, 25,2,ST7735_CYAN);
            break;   
            
       case 4:
            fillRect(data_time_x-1, data_time_y+16+yinc, 25,2,ST7735_BLACK);
            fillRect(data_time_x-1+xinc, data_time_y+16+yinc, 25,2,ST7735_CYAN);
            break; 
       case 5:
            fillRect(data_time_x-1+xinc, data_time_y+16+yinc, 25,2,ST7735_BLACK);
            fillRect(data_time_x-1+2*xinc, data_time_y+16+yinc, 25,2,ST7735_CYAN);
            break;              
    }
}
void Do_Setup_Time(void)
{
    char Key_Next_Flag, Key_Up_Flag, Key_Dn_Flag, Key_Abort_Flag, Key_Done_Flag;
    char Select_Field, Setup_Mode;    
    Setup_Mode = 1;
    Select_Field = 0;
    DS3231_Read_Time(DS3231_ID);
    setup_second = bcd_2_dec(second);
    setup_minute = bcd_2_dec(minute);
    setup_hour = bcd_2_dec(hour);
    setup_day = bcd_2_dec(day);
    setup_month = bcd_2_dec(month);
    setup_year = bcd_2_dec(year);
    Initialize_Setup_Time_Screen();
    Update_Setup_Time_Screen();
    while (Setup_Mode == 1)
    {
        if (nec_ok == 1)
        { 
            INTCON3bits.INT2IE = 1;                 // Enable external interrupt
            INTCON2bits.INTEDG2 = 0;                // Edge programming for INT0 falling edge
            nec_ok = 0;
            
            if (nec_code == Key_Next)   Key_Next_Flag = 1;  // '>>|' key
            if (nec_code == Key_Up)     Key_Up_Flag = 1;    // 'CH+' key
            if (nec_code == Key_Dn)     Key_Dn_Flag = 1;    // 'CH-' key
            if (nec_code == Key_Abort)  Key_Abort_Flag = 1; // '|<<' key
            if (nec_code == Key_Done)   Key_Done_Flag = 1;  // '>||' key'         
    
            if (Key_Next_Flag == 1 )
            {
                Key_Next_Flag = 0;
                Select_Field++;
                if (Select_Field == 6) Select_Field = 0;
                Update_Setup_Screen_Cursor(Select_Field);
                Key_Next_Flag = 0;
            }
            if (Key_Up_Flag == 1 )
            {
                switch (Select_Field)
                {
                    case 0:
                        setup_hour++;
                        if (setup_hour == 24) setup_hour = 0; 
                        break;
                    case 1:
                        setup_minute++;
                        if (setup_minute == 60) setup_minute = 0;
                        break;
                    case 2:
                       setup_second++;
                        if (setup_second == 60) setup_second = 0;                       
                        break;  
                    case 3:
                        setup_month++;
                        if (setup_month == 13) setup_month = 1;
                        break;  
                    case 4:
                        setup_day++;
                        if (setup_day == 32) setup_day = 1;
                        break;   
                    case 5:
                        setup_year++;
                        if (setup_year == 100) setup_year = 0;
                        break;   
                    default:
                        break;
                }    
                Update_Setup_Time_Screen();
                Key_Up_Flag = 0;
            }
            if (Key_Dn_Flag == 1 )
            {
                switch (Select_Field)
                {
                    case 0:
                        if (setup_hour == 0) setup_hour = 23;
                        else --setup_hour;
                        break;
                    case 1:
                        if (setup_minute == 0) setup_minute = 59;
                        else --setup_minute;                              
                        break;
                    case 2:
                        if (setup_second == 0) setup_second = 59;
                        else --setup_second;                       
                        break;  
                    case 3:
                        if (setup_month == 01) setup_month = 12;
                        else --setup_month;
                        break;  
                    case 4:
                        if (setup_day == 1) setup_day = 31;
                        else --setup_day;
                        break;   
                    case 5:
                        if (setup_year == 0) setup_year = 99;
                        else --setup_year;
                        break;   
                    default:
                    break;
                }
                
                Update_Setup_Time_Screen();
                Key_Dn_Flag = 0;                      
            }
            if (Key_Done_Flag == 1 )
            {
                second = dec_2_bcd(setup_second);
                minute = dec_2_bcd(setup_minute);
                hour = dec_2_bcd(setup_hour);
                dow = 0;
                day = dec_2_bcd(setup_day);
                month = dec_2_bcd(setup_month);
                year = dec_2_bcd(setup_year);
                Key_Done_Flag = 0;
                DS3231_Write_Time(DS3231_ID);
                DS3231_Read_Time(DS3231_ID);
                Initialize_Main_Screen();
                Setup_Mode = 0;               
            }
            
            if (Key_Abort_Flag == 1 )
            {
                Key_Abort_Flag = 0;
                DS3231_Read_Time(DS3231_ID);
                Initialize_Main_Screen();
                Setup_Mode = 0;               
            }
        }    
    }
}
    
void Initialize_Setup_Alarm_Screen(void) 
{ 
    fillScreen(ST7735_BLACK);                                   // Fills background of screen with color passed to it
 
    strcpy(txt, " ECE3301L Spring 2019\0");                     // Text displayed 
    drawtext(start_x , start_y, txt, ST7735_WHITE  , ST7735_BLACK, TS_1);
                                                                // X and Y coordinates of where the text is to be displayed
    strcpy(txt, "Alrm Setup");                                  // Text displayed 
    drawtext(start_x+5 , start_y+15, txt, ST7735_MAGENTA, ST7735_BLACK, TS_2); 
    
    strcpy(txt, "Time");
    drawtext(time_x  , time_y , txt, ST7735_BLUE   , ST7735_BLACK, TS_1);
    fillRect(data_time_x-1, data_time_y+16, 25,2,ST7735_CYAN);
}
void Update_Setup_Alarm_Screen(void)
{
    setup_alarm_time[0]  = (setup_alarm_hour/10)  + '0';
    setup_alarm_time[1]  = (setup_alarm_hour%10)  + '0';  
    setup_alarm_time[3]  = (setup_alarm_minute/10)  + '0';
    setup_alarm_time[4]  = (setup_alarm_minute %10)+ '0';
    setup_alarm_time[6]  = (setup_alarm_second/10)  + '0';
    setup_alarm_time[7]  = (setup_alarm_second %10)+ '0'; 
   
    drawtext(data_time_x, data_time_y, setup_alarm_time, ST7735_CYAN, ST7735_BLACK, TS_2);
}
void Do_Setup_Alarm_Time(void)
{
    char Key_Next_Flag, Key_Up_Flag, Key_Dn_Flag, Key_Abort_Flag, Key_Done_Flag;
    char Select_Field, Setup_Mode;    
    Setup_Mode = 1;
    Select_Field = 0;
    DS3231_Read_Alarm_1_Time(DS3231_ID);
    
    setup_alarm_second = bcd_2_dec(alarm_second);
    setup_alarm_minute = bcd_2_dec(alarm_minute);
    setup_alarm_hour = bcd_2_dec(alarm_hour);
  
