martingener/microcontrollerfinal/Control_PIC18F4321.c
    Initialize_Setup_Alarm_Screen();
    Update_Setup_Alarm_Screen();
    
    while (Setup_Mode == 1)
    {
        if (nec_ok == 1)
        { 
            INTCON3bits.INT2IE = 1;                 // Enable external interrupt
            INTCON2bits.INTEDG2 = 0;                // Edge programming for INT0 falling edge
            nec_ok = 0;
            
            if (nec_code == Key_Next)   Key_Next_Flag = 1;  // '>>|' key
            if (nec_code == Key_Up)     Key_Up_Flag = 1;    // 'CH+' key
            if (nec_code == Key_Dn)     Key_Dn_Flag = 1;    // 'CH-' key
            if (nec_code == Key_Abort)  Key_Abort_Flag = 1; // '|<<' key
            if (nec_code == Key_Done)   Key_Done_Flag = 1;  // '>||' key'         
    
            if (Key_Next_Flag == 1 )
            {
                Key_Next_Flag = 0;
                Select_Field++;
                if (Select_Field == 3) Select_Field = 0;
                Update_Setup_Screen_Cursor(Select_Field);
                Key_Next_Flag = 0;
            }
            if (Key_Up_Flag == 1 )
            {
                switch (Select_Field)
                {
                    case 0:
                        setup_alarm_hour++;  //setup_alarm_hour
                        if (setup_alarm_hour == 24) setup_alarm_hour = 0; 
                        break;
                    case 1:
                        setup_alarm_minute++;
                        if (setup_alarm_minute == 60) setup_alarm_minute = 0;
                        break;
                    case 2:
                       setup_alarm_second++;
                        if (setup_alarm_second == 60) setup_alarm_second = 0;                       
                        break;  
                    default:
                        break;
                }    
                Update_Setup_Alarm_Screen();   //Update_Setup_Alarm_Screen();
                Key_Up_Flag = 0;
            }
            if (Key_Dn_Flag == 1 )
            {
                switch (Select_Field)
                {
                    case 0:
                        if (setup_alarm_hour == 0) setup_alarm_hour = 23; //setup_alarm_hour
                        else --setup_alarm_hour;
                        break;
                    case 1:
                        if (setup_alarm_minute == 0) setup_alarm_minute = 59;  //setup_alarm_minute
                        else --setup_alarm_minute;                              
                        break;
                    case 2:
                        if (setup_alarm_second == 0) setup_alarm_second = 59;
                        else --setup_alarm_second;                       
                        break;  
                    default:
                    break;
                }
                
                Update_Setup_Alarm_Screen();  //Update_Setup_Alarm_Screen();
                Key_Dn_Flag = 0;                      
            }
            if (Key_Done_Flag == 1 )
            {
                alarm_second = dec_2_bcd(setup_alarm_second);
                alarm_minute = dec_2_bcd(setup_alarm_minute);
                alarm_hour = dec_2_bcd(setup_alarm_hour);
                
                Key_Done_Flag = 0;
                DS3231_Write_Alarm_1_Time(DS3231_ID);
                DS3231_Read_Alarm_1_Time(DS3231_ID);
                Initialize_Main_Screen();
                Setup_Mode = 0;               
            }
            
            if (Key_Abort_Flag == 1 )
            {
                Key_Abort_Flag = 0;
                DS3231_Read_Time(DS3231_ID);
                Initialize_Main_Screen();
                Setup_Mode = 0;               
            }
        }    
    }
}    
 
void Do_Setup_Heater_Temp(void)
{
    // Put your code here
    Initialize_Setup_Heater_Screen();
    char Key_Up_Flag, Key_Dn_Flag, Key_Abort_Flag, Key_Done_Flag;
    char Select_Field, Setup_Mode;    
    Setup_Mode = 1;
    Select_Field = 0;
    Update_Setup_Heater_Screen();
    setup_heater_temp=set_heater_temp;
    
    while (Setup_Mode == 1)
    {
        if (nec_ok == 1)
        { 
            INTCON3bits.INT2IE = 1;                 // Enable external interrupt
            INTCON2bits.INTEDG2 = 0;                // Edge programming for INT0 falling edge
            nec_ok = 0;
            
            //if (nec_code == Key_Next)   Key_Next_Flag = 1;  // '>>|' key
            if (nec_code == Key_Up)     Key_Up_Flag = 1;    // 'CH+' key
            if (nec_code == Key_Dn)     Key_Dn_Flag = 1;    // 'CH-' key
            if (nec_code == Key_Abort)  Key_Abort_Flag = 1; // '|<<' key
            if (nec_code == Key_Done)   Key_Done_Flag = 1;  // '>||' key'         
    
           
            if (Key_Up_Flag == 1 )
            {
                set_heater_temp++;
                Key_Up_Flag = 0;
                Update_Setup_Heater_Screen();
                
                    
             }
            if (Key_Dn_Flag == 1 )
            {
                set_heater_temp--;
                Key_Dn_Flag = 0;
                Update_Setup_Heater_Screen();
                                   
            }
            if (Key_Done_Flag == 1 )
            {
                Key_Done_Flag = 0;
                Initialize_Main_Screen();
                Setup_Mode = 0;     
                             
            }
            
            if (Key_Abort_Flag == 1 )
            {
                set_heater_temp=setup_heater_temp;
                Key_Abort_Flag = 0;
                Initialize_Main_Screen();
                Setup_Mode = 0;                  
            }
        }    
    }
}  
    
void Initialize_Setup_Heater_Screen(void) 
{ 
    fillScreen(ST7735_BLACK);                                    // Fills background of screen with color passed to it
 
    strcpy(txt, " ECE3301L Spring 2019\0");                      // Text displayed 
    drawtext(start_x , start_y, txt, ST7735_WHITE  , ST7735_BLACK, TS_1);   // X and Y coordinates of where the text is to be displayed
    strcpy(txt, "Heater\0"); // Text displayed 
    drawtext(start_x+25 , start_y+15, txt, ST7735_MAGENTA, ST7735_BLACK, TS_2);     
    strcpy(txt, "Setup\0");
    drawtext(start_x+25 , start_y+35, txt, ST7735_MAGENTA, ST7735_BLACK, TS_2);                           
    strcpy(txt, "Heater Set Temp");
    drawtext(S_HTR_S_x , S_HTR_S_y, txt, ST7735_YELLOW  , ST7735_BLACK, TS_1);
    drawCircle(S_cirf_HTR_S_x, S_cirf_HTR_S_y , 2  , ST7735_BLUE);
    strcpy(txt, "F");
    drawtext(S_tempf_HTR_S_x , S_tempf_HTR_S_y, txt, ST7735_BLUE , ST7735_BLACK, TS_2);
}
    
