martingener/microcontrollerfinal/Control_PIC18F4321.c
void Update_Setup_Heater_Screen(void)
{
    setup_heater_S_text[0]  = set_heater_temp/10  + '0';
 setup_heater_S_text[1]  = set_heater_temp%10  + '0';
    drawtext(S_data_HTR_S_x, S_data_HTR_S_y ,setup_heater_S_text, ST7735_BLUE, ST7735_BLACK, TS_2);
}
void DS3231_Init(char device)
{
char control;
  control = I2C_Write_Address_Read_One_Byte(device, DS3231_Add_0E);
  control = control & 0x01;
  control = control | 0x25;
  I2C_Write_Address_Write_One_Byte(device, DS3231_Add_0E, control);
  DS3231_Read_Alarm_1_Time(DS3231_ID);  //     
  alarm_second = alarm_second &0x7f;
  alarm_minute = alarm_minute &0x7f;
  alarm_hour   = alarm_hour   &0x7f;
  alarm_date   = 0x80;
  DS3231_Write_Alarm_1_Time(DS3231_ID);
}
void DS3231_Turn_On_Alarm(char device)
{
    INTCON3bits.INT1IE = 1;
    I2C_Start();                        // Start I2C protocol
    I2C_Write((device << 1) | 0);       // DS3231 address
    I2C_Write(DS3231_Add_0E);           // Send starting register address
                        
    I2C_Write(0x07);  // alarm enable
    I2C_Write(0x80);                    // alarm flag = 0
    I2C_Stop();
    delay_ms(20);                       // Wait 20 ms 
    
      
}
void DS3231_Turn_Off_Alarm(char device)
{
    INTCONbits.INT0IF = 0;
    INTCON3bits.INT1IE = 0;
    I2C_Start();                        // Start I2C protocol
    I2C_Write((device << 1) | 0);       // DS3231 address
    I2C_Write(DS3231_Add_0E);           // Send starting register address
    I2C_Write(0x06);                    // alarm enable = 0
    I2C_Write(0x80);                    // alarm flag = 0
    I2C_Stop();
    delay_ms(20);                       // Wait 20 ms 
}
 
void DS3231_Read_Time(char Device)
{
    I2C_Start();                        // Start I2C protocol
    I2C_Write((Device << 1) | 0);       // DS3231 address
    I2C_Write(DS3231_Add_00);           // Send register address
    I2C_ReStart();                      // Restart I2C
    I2C_Write((Device << 1) | 1);       // Initialize data read
    second = I2C_Read(ACK);             // Read seconds from register 0
    minute = I2C_Read(ACK);             // Read minutes from register 1
    hour   = I2C_Read(ACK);             // Read hour from register 2
    dow    = I2C_Read(ACK);             // Read day of week register 3
    day    = I2C_Read(ACK);             // Read day from register 4
    month  = I2C_Read(ACK);             // Read month from register 5
    year   = I2C_Read(NAK);             // Read year from register 6
    I2C_Stop();                         // Stop I2C protocol
    delay_ms(50);
}
void DS3231_Read_Alarm_1_Time(char Device)
{
    I2C_Start();                        // Start I2C protocol
    I2C_Write((Device << 1) | 0);       // DS3231 address
    I2C_Write(DS3231_Add_07);           // Send register address
    I2C_ReStart();                      // Restart I2C
    I2C_Write((Device << 1) | 1);       // Initialize data read
    alarm_second = I2C_Read(ACK);             // Read seconds from register 0
    alarm_minute = I2C_Read(ACK);             // Read minutes from register 1
    alarm_hour   = I2C_Read(NAK);             // Read hour from register 2
    I2C_Stop();                         // Stop I2C protocol
    delay_ms(50);
}
int DS3231_Read_Temp(char Device)
{
char T_lo, T_hi;
int temp;
    I2C_Start();                        // Start I2C protocol
    I2C_Write((Device << 1) | 0);       // DS3231 address
    I2C_Write(DS3231_Add_11);           // Send register address
    I2C_ReStart();                      // Restart I2C
    I2C_Write((Device << 1) | 1);       // Initialize data read
    T_hi = I2C_Read(ACK);               // read temp hi
    T_lo = I2C_Read(NAK);               // read temp low
    I2C_Stop();                         // Stop I2C protocol 
    delay_ms(50);
    if ((T_hi & 0x80) == 0x80) temp = -(0x80 - (T_hi & 0x7f));
    else temp = (T_hi & 0x7f);
    return (temp);
}
void DS3231_Write_Time(char Device)
{
    I2C_Start();                        // Start I2C protocol
    I2C_Write((Device << 1) | 0);       // DS3231 address
    I2C_Write(DS3231_Add_00);           // Send starting register address
    I2C_Write(second);                  // Reset seconds as 0 and start oscillator
    I2C_Write(minute);                  // Write minute value to DS3231
    I2C_Write(hour);                    // Write hour value to DS3231
    I2C_Write(dow);                     // Write day of week to DS3231
    I2C_Write(day);                     // Write date value to DS3231
    I2C_Write(month);                   // Write month value to DS3231
    I2C_Write(year);                    // Write year value to DS3231       //No I2C_Stop(); possible error?
    delay_ms(20);                       // Wait 20 ms   
}
void DS3231_Write_Alarm_1_Time(char Device)
{
    I2C_Start();                        // Start I2C protocol
    I2C_Write((Device << 1) | 0);       // DS3231 address
    I2C_Write(DS3231_Add_07);           // Send starting register address
    I2C_Write(alarm_second);                  // Reset seconds as 0 and start oscillator
    I2C_Write(alarm_minute);                  // Write minute value to DS3231
    I2C_Write(alarm_hour);                    // Write hour value to DS3231
    I2C_Write(alarm_date);
    delay_ms(20);
}   
void delay_ms(int ms)
{          
#define COUNT_PER_MS    _XTAL_FREQ/4000     // Count per ms = 2000             
#define COUNT_SCALED    COUNT_PER_MS/32     //
    int count;
    count = COUNT_SCALED * ms;
    count = (0xffff - count);
    T0CON = 0x04;                       // Timer 0, 16-bit mode, pre-scaler 1:32
        
    TMR0L = count & 0x00ff;             // set the lower byte of TMR
    TMR0H = count >> 8;                 // set the upper byte of TMR
    INTCONbits.TMR0IF = 0;              // clear the Timer 0 flag
    T0CONbits.TMR0ON = 1;               // Turn on the Timer 0
    while (INTCONbits.TMR0IF == 0); 
    // wait for the Timer Flag to be 1 for done
    T0CONbits.TMR0ON = 0;               // turn off the Timer 0
}

