martingener/microcontrollerfinal/Control_PIC18F4321.c
int bcd_2_dec (char bcd)
{
    int dec;
    dec = ((bcd>> 4) * 10) + (bcd & 0x0f);
    return dec;
}
int dec_2_bcd (char dec)
{
    int bcd;
    bcd = ((dec / 10) << 4) + (dec % 10);
    return bcd;
    
}
void gen_2khz_sound()
{
PR2 = 0b01111100 ;
T2CON = 0b00000101 ;
CCPR2L = 0b00111110 ;
CCP2CON = 0b00011100 ;
}
void turn_off_sound()
{
    CCP2CON = 0x0;
    BEEP = 0;      
}
unsigned int Get_Full_ADC(void)
{
int result;
     ADCON0bits.GO=1;                       // Start Conversion
     while(ADCON0bits.DONE==1);             // Wait for conversion to be completed (DONE=0)
     result = (ADRESH * 0x100) + ADRESL;    // Combine result of upper byte and lower byte into
     return result;                         // return the most significant 8- bits of the result.
}
void Select_ADC(char ADC_Channel)
{
    ADCON0 = 0x01 + ADC_Channel * 4;
}
void Do_LED_Out(char Volt)
{
    if (Volt > 2.5)
    {
        
            PORTDbits.RD3 = 1;
            PORTDbits.RD4 = 1;
            PORTDbits.RD5 = 1;
        
    } 
    else
    {
        PORTDbits.RD3 = 0;
        PORTDbits.RD4 = 0;
        PORTDbits.RD5 = 0;
    }    
}
void Do_LED_Up()
{
    if(LED_Intensity == 90) LED_Intensity = 0;
    else LED_Intensity = LED_Intensity + 10;
    SPI_out(LED_Intensity + 100);
}
void Do_LED_Down()
{
    if(LED_Intensity == 0) LED_Intensity = 0;
    else LED_Intensity = LED_Intensity - 10;
    SPI_out(LED_Intensity + 100);
}
void  SPI_out(unsigned char SPI_data)
{
    int i;
    char First_byte, Second_byte;
    First_byte = (SPI_data & 0xf0) >> 4;   // take the upper nibble of data and >> 4
                                            //times 
    First_byte = 0x30 | First_byte;  // set the upper nibble with 0x30 
    Second_byte = (SPI_data & 0x0f) <<4; // take the lower nibble of data and << 4 times
    Chip_Select = 0;   // set the chip select of the D/A chip to be low
    SSPBUF = First_byte;   // output the first byte to the SPI bus
    while (SSPSTATbits.BF == 0);  // wait for status done
    for ( i=0;i<1;i++);   // small delay
    SSPBUF = Second_byte;  // output the second byte to the SPI bus
    while(SSPSTATbits.BF == 0);  // wait for status done
    for ( i=0;i<1;i++);   // small delay
    Chip_Select = 1;   // raise chip select high
}
float Read_Volt_In(void)
{
    float STEP;
    Select_ADC(0);
    STEP = Get_Full_ADC();
    Volt = (STEP * 4.0/20000);
    return Volt;
}
void LED_Alarm(void)
{
    count++;
    if(count == 1)
    {
        D1RED   = 1;
        D1GREEN = 0;
        D1BLUE  = 0;
    }
    
    if(count == 2)
    {
        D1RED   = 0;
        D1GREEN = 1;
        D1BLUE  = 0;
    }
    if(count == 3)
    {
        D1RED   = 1;
        D1GREEN = 1;
        D1BLUE  = 0;
    }
    
    if(count == 4)
    {    
        D1RED   = 0;
        D1GREEN = 0;
        D1BLUE  = 1;
    }
    
    if (count == 5)
    {
        D1RED   = 1;
        D1GREEN = 0;
        D1BLUE  = 1;
    }
    
    if (count == 6)
    {
        D1RED   = 0;
        D1GREEN = 1;
        D1BLUE  = 1;
    }
    
    if(count == 7)
    {
        D1RED   = 1;
        D1GREEN = 1;
        D1BLUE  = 1;
    count = 0;
    }
}
